In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
ser=pd.Series(['Ruby','Serr','Python',np.NAN])
ser

0      Ruby
1      Serr
2    Python
3       NaN
dtype: object

In [4]:
ser.isnull()

0    False
1    False
2    False
3     True
dtype: bool

In [5]:
ser.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [6]:
ser[0]=None
ser

0      None
1      Serr
2    Python
3       NaN
dtype: object

### Dropping the null values

In [8]:
ser.dropna()

1      Serr
2    Python
dtype: object

In [9]:
data=pd.Series(['Ruby','Serr','Python',np.NAN])
data

0      Ruby
1      Serr
2    Python
3       NaN
dtype: object

In [10]:
data[data.notnull()]

0      Ruby
1      Serr
2    Python
dtype: object

In [12]:
data_df=pd.DataFrame([[np.nan,10,30],[23,np.nan,90],[23,56,89]],columns=list('ABC'))
data_df

      A     B   C
0   NaN  10.0  30
1  23.0   NaN  90
2  23.0  56.0  89

In [13]:
data_df.dropna()

      A     B   C
2  23.0  56.0  89

In [14]:
data_df

      A     B   C
0   NaN  10.0  30
1  23.0   NaN  90
2  23.0  56.0  89

In [15]:
data_df['D']=np.nan
data_df

      A     B   C   D
0   NaN  10.0  30 NaN
1  23.0   NaN  90 NaN
2  23.0  56.0  89 NaN

In [16]:
data_df.dropna(how='all',axis=1)

      A     B   C
0   NaN  10.0  30
1  23.0   NaN  90
2  23.0  56.0  89

In [19]:
data_df.dropna(thresh=1,axis=1)
### Thre is used to remove all null values from the columns

      A     B   C
0   NaN  10.0  30
1  23.0   NaN  90
2  23.0  56.0  89

In [20]:
data_df.fillna(20)

      A     B   C     D
0  20.0  10.0  30  20.0
1  23.0  20.0  90  20.0
2  23.0  56.0  89  20.0

In [21]:
data_df

      A     B   C   D
0   NaN  10.0  30 NaN
1  23.0   NaN  90 NaN
2  23.0  56.0  89 NaN

In [22]:
data_df.fillna({'A':20,'B':30,'C':40,'D':23})

      A     B   C     D
0  20.0  10.0  30  23.0
1  23.0  30.0  90  23.0
2  23.0  56.0  89  23.0

In [25]:
data=pd.DataFrame(np.arange(9).reshape((3,3)),columns=list('ABC'),index=['TOKYO','JAPAN','INDIA'])
data

       A  B  C
TOKYO  0  1  2
JAPAN  3  4  5
INDIA  6  7  8

In [26]:
data['D']=np.nan
data

       A  B  C   D
TOKYO  0  1  2 NaN
JAPAN  3  4  5 NaN
INDIA  6  7  8 NaN

In [29]:
data.loc['INDIA','C']=np.nan
data

         A    B    C   D
TOKYO  0.0  1.0  2.0 NaN
JAPAN  3.0  4.0  5.0 NaN
INDIA  6.0  7.0  NaN NaN
2      NaN  NaN  NaN NaN

In [32]:
data.fillna(method='ffill')

         A    B    C   D
TOKYO  0.0  1.0  2.0 NaN
JAPAN  3.0  4.0  5.0 NaN
INDIA  6.0  7.0  5.0 NaN
2      6.0  7.0  5.0 NaN

In [33]:
data.fillna(method='bfill')

         A    B    C   D
TOKYO  0.0  1.0  2.0 NaN
JAPAN  3.0  4.0  5.0 NaN
INDIA  6.0  7.0  NaN NaN
2      NaN  NaN  NaN NaN

In [35]:
data.fillna(20)

          A     B     C     D
TOKYO   0.0   1.0   2.0  20.0
JAPAN   3.0   4.0   5.0  20.0
INDIA   6.0   7.0  20.0  20.0
2      20.0  20.0  20.0  20.0